Revit 2026 API

# AssetPropertiesGet Method

---

Gets the property at the given index.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AssetProperty Get(
	int index
)
```
```vb
Public Function Get (
	index As Integer
) As AssetProperty
```
```cpp
public:
AssetProperty^ Get(
	int index
)
```
```fsharp
member Get :
        index : int -> AssetProperty
```

#### Parameters

index Int32
     An integer index.

#### Return Value

AssetProperty The property at the given index.

| Exception | Condition |
| --- | --- |
| ArgumentException | index is out of range. |

#### Reference

AssetProperties Class

Autodesk.Revit.DB.Visual Namespace